ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
/**
  ******************************************************************************
  * @file    bl606p_clock.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_clock.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  CLOCK
 *  @{
 */

/** @defgroup  CLOCK_Private_Macros
 *  @{
 */

/*@} end of group CLOCK_Private_Macros */

/** @defgroup  CLOCK_Private_Types
 *  @{
 */

/*@} end of group CLOCK_Private_Types */

/** @defgroup  CLOCK_Private_Variables
 *  @{
 */

/*@} end of group CLOCK_Private_Variables */

/** @defgroup  CLOCK_Global_Variables
 *  @{
 */

/*@} end of group CLOCK_Global_Variables */

/** @defgroup  CLOCK_Private_Fun_Declaration
 *  @{
 */

/*@} end of group CLOCK_Private_Fun_Declaration */

/** @defgroup  CLOCK_Private_Functions
 *  @{
 */

/*@} end of group CLOCK_Private_Functions */

/** @defgroup  CLOCK_Public_Functions
 *  @{
 */

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_WIFI_PLL_Output(uint32_t pllOut)
{
    uint8_t xtalType = 0;
    uint32_t tmpVal = 0;
    uint32_t vcoFreq = 0;
    uint32_t calculationDiv = (1 << 19);

    tmpVal = BL_GET_REG_BITS_VAL(BL_RD_REG(GLB_BASE, GLB_WIFI_PLL_CFG6), GLB_WIFIPLL_SDMIN);

    if (HBN_Get_Xtal_Type(&xtalType) == SUCCESS) {
        switch (xtalType)
        {
            /* Calculation method:* wifipll_sdmin / calculationDiv * xtal_freq * 1000 * 1000 / cpupll_refdiv_ratio */
            case GLB_XTAL_NONE:
                return (0);
            case GLB_XTAL_24M:
                /* 960000000 */
                vcoFreq = tmpVal / calculationDiv * 24 * 1000 * 1000;
                break; 
            case GLB_XTAL_32M:
                /* 960000000 */
                vcoFreq = tmpVal / calculationDiv * 32 * 1000 * (1000 / 2);
                break; 
            case GLB_XTAL_38P4M:
                /* 960000000 */
                vcoFreq = tmpVal / calculationDiv * 384 * 100 * (1000 / 2);
                break;
            case GLB_XTAL_40M:
                /* 960000000 */
                vcoFreq = tmpVal / calculationDiv * 40 * 1000 * (1000 / 2);
                break;
            case GLB_XTAL_26M:
                /* 959920000 */
                vcoFreq = 200 * tmpVal / calculationDiv * 26 * 5000;
                break;
            case GLB_XTAL_RC32M:
                /* 960000000 */
                vcoFreq = tmpVal / calculationDiv * 32 * 1000 * (1000 / 2);
                break;            
            default:
                return (0);
        }
    } else {
        return (0);
    }

    if ( (vcoFreq >= 955000000) && (vcoFreq <= 965000000) ) {
        /* vcoFreq:959920000~960000000 */
        return (pllOut);
    } else {
        return (0);
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_CPU_PLL_Output(uint32_t pllOut)
{
    uint8_t xtalType = 0;
    uint32_t tmpVal = 0;
    uint32_t vcoFreq = 0;
    uint32_t calculationDiv = (1 << 11);

    tmpVal = BL_GET_REG_BITS_VAL(BL_RD_REG(CCI_BASE, CCI_CPU_PLL_CFG6), CCI_CPUPLL_SDMIN);

    if (HBN_Get_Xtal_Type(&xtalType) == SUCCESS) {
        switch (xtalType)
        {
            /* Calculation method:xtal_freq * 1000 * cpupll_sdmin / calculationDiv * 1000 / cpupll_refdiv_ratio */
            case GLB_XTAL_NONE:
                return (0);
            case GLB_XTAL_24M:
                /* 480000000;399996000;379998000 */
                vcoFreq = 24 * 1000 * tmpVal / calculationDiv * (1000 / 2);
                break; 
            case GLB_XTAL_32M:
                /* 480000000;400000000;380000000 */
                vcoFreq = 32 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break; 
            case GLB_XTAL_38P4M:
                /* 480000000;399998250;379996750 */
                vcoFreq = 384 * 100 * tmpVal / calculationDiv * (1000  / 4); 
                break;
            case GLB_XTAL_40M:
                /* 480000000;400000000;380000000 */
                vcoFreq = 40 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break;
            case GLB_XTAL_26M:
                /* 479997000;399997500;379996000 */
                vcoFreq = 26 * 1000 * tmpVal / calculationDiv * (1000 / 2);
                break;
            case GLB_XTAL_RC32M:
                /* 480000000;400000000;380000000 */
                vcoFreq = 32 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break;            
            default:
                return (0);
        }
    } else {
        return (0);
    }

    if ( (vcoFreq >= 475000000) && (vcoFreq <= 485000000) ) {
        /* vcoFreq:479997000~480000000 */
        return (pllOut / 100 * 120);
    } else if ( (vcoFreq >= 395000000 && vcoFreq <= 405000000) ) {
        /* vcoFreq:399996000~400000000 */
        return (pllOut);
    } else if ( (vcoFreq >= 375000000 && vcoFreq <= 385000000) ) {
        /* vcoFreq:379996000~380000000 */
        return (pllOut / 100 * 95);
    } else {
        return (0);
    }
}

