ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_AUPLL_Output(CLOCK_AUPLL_Type clockAupllType)
{
    uint8_t xtalType = 0;
    uint32_t tmpVal = 0;
    uint32_t vcoFreq = 0;
    uint32_t calculationDiv = (1 << 11);

    tmpVal = BL_GET_REG_BITS_VAL(BL_RD_REG(CCI_BASE, CCI_AUDIO_PLL_CFG6), CCI_AUPLL_SDMIN);

    if (HBN_Get_Xtal_Type(&xtalType) == SUCCESS) {
        switch (xtalType)
        {
            /* Calculation method:xtal_freq * 1000 * aupll_sdmin / calculationDiv * 1000 / cpupll_refdiv_ratio */
            case GLB_XTAL_NONE:
                return (0);
            case GLB_XTAL_24M:
                /* 442365000;451582000 */
                vcoFreq = 24 * 1000 * tmpVal / calculationDiv * (1000 / 2);
                break; 
            case GLB_XTAL_32M:
                /* 442367000;451582000 */
                vcoFreq = 32 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break; 
            case GLB_XTAL_38P4M:
                /* 442364000;451579500; */
                vcoFreq = 384 * 100 * tmpVal / calculationDiv * (1000  / 4); 
                break;
            case GLB_XTAL_40M:
                /* 442368000;451582000 */
                vcoFreq = 40 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break;
            case GLB_XTAL_26M:
                /* 442368000;451578500 */
                vcoFreq = 26 * 1000 * tmpVal / calculationDiv * (1000 / 2);
                break;
            case GLB_XTAL_RC32M:
                /* 442367000;451582000 */
                vcoFreq = 32 * 1000 * tmpVal / calculationDiv * (1000  / 4);
                break;            
            default:
                return (0);
        }
    } else {
        return (0);
    }

    if ( (vcoFreq >= 451000000) && (vcoFreq <= 452000000) ) {
        /* vcoFreq:451578500~451582000 */
        vcoFreq = 451584000;
    } else if ( (vcoFreq >= 442000000) && (vcoFreq <= 443000000) ) {
        /* vcoFreq:442364000~442368000 */
        vcoFreq = 442368000;
    } else {
        return (0);
    }

    switch (clockAupllType) {
        case CLOCK_AUPLL_DIV1:
            return (vcoFreq);
        case CLOCK_AUPLL_DIV2:
            return (vcoFreq / 2);
        case CLOCK_AUPLL_DIV2P5:
            return (vcoFreq * 2 / 5);
        case CLOCK_AUPLL_DIV3:
            return (vcoFreq / 3);
        case CLOCK_AUPLL_DIV4:
            return (vcoFreq / 4);
        case CLOCK_AUPLL_DIV5:
            return (vcoFreq / 5);
        case CLOCK_AUPLL_DIV6:
            return (vcoFreq / 6);
        case CLOCK_AUPLL_DIV10:
            return (vcoFreq / 10);
        case CLOCK_AUPLL_DIV15:
            return (vcoFreq / 15);
        default:
            return (0);
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_Audio_PLL_Output()
{
    uint32_t tmpVal = 0;

    tmpVal = BL_GET_REG_BITS_VAL(BL_RD_REG(CCI_BASE, CCI_AUDIO_PLL_CFG1), CCI_AUPLL_POSTDIV);

    return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV1) / tmpVal;
    
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_MIPI_PLL_Output()
{
    uint8_t xtalType = 0;
    uint32_t tmpVal = 0;
    uint32_t vcoFreq = 0;
    uint32_t calculationDiv = (1 << 11);

    tmpVal = BL_GET_REG_BITS_VAL(BL_RD_REG(GLB_BASE, GLB_MIPI_PLL_CFG6), GLB_MIPIPLL_SDMIN);

    if (HBN_Get_Xtal_Type(&xtalType) == SUCCESS) {
        switch (xtalType)
        {
            /* Calculation method:xtal_freq * 1000 or 500 * mipipll_sdmin / calculationDiv * 1000 or 2000 / cpupll_refdiv_ratio */
            case GLB_XTAL_NONE:
                return (0);
            case GLB_XTAL_24M:
                /* 1500000000 */
                vcoFreq = 24 * 1000 * tmpVal / calculationDiv * 1000;
                break; 
            case GLB_XTAL_32M:
                /* 1500000000 */
                vcoFreq = 32 * 500 * tmpVal / calculationDiv * (2000  / 2);
                break; 
            case GLB_XTAL_38P4M:
                /* 1500000000 */
                vcoFreq = 384 * 50 * tmpVal / calculationDiv * (2000  / 2); 
                break;
            case GLB_XTAL_40M:
                /* 1500000000 */
                vcoFreq = 40 * 500 * tmpVal / calculationDiv * (2000  / 2);
                break;
            case GLB_XTAL_26M:
                /* 1499989000 */
                vcoFreq = 26 * 1000 * tmpVal / calculationDiv * 1000;
                break;
            case GLB_XTAL_RC32M:
                /* 1500000000 */
                vcoFreq = 32 * 500 * tmpVal / calculationDiv * (2000  / 2);
                break;            
            default:
                return (0);
        }
    } else {
        return (0);
    }

    if ( (vcoFreq >= 1490000000) && (vcoFreq <= 1510000000) ) {
        /* vcoFreq:1499989000~1500000000 */
        return (1500000000);
    } else {
        return (0);
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_Get_WIFI_PLL_Output(uint32_t pllOut)
{
    return Clock_Get_WIFI_PLL_Output(pllOut);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_EMI_Get_WIFI_PLL_Output(uint32_t pllOut)
{
    return Clock_Get_WIFI_PLL_Output(pllOut);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_EMI_Get_CPU_PLL_Output(uint32_t pllOut)
{
    return Clock_Get_CPU_PLL_Output(pllOut);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Xtal_Output(void)
{
    uint8_t xtalType = 0;

    if (HBN_Get_Xtal_Type(&xtalType) == SUCCESS) {
        switch (xtalType) {
            case GLB_XTAL_NONE:
                return 0;
            case GLB_XTAL_24M:
                return 24 * 1000 * 1000;
            case GLB_XTAL_32M:
                return 32 * 1000 * 1000;
            case GLB_XTAL_38P4M:
                return 38.4 * 1000 * 1000;
            case GLB_XTAL_40M:
                return 40 * 1000 * 1000;
            case GLB_XTAL_26M:
                return 26 * 1000 * 1000;
            case GLB_XTAL_RC32M:
                return 32 * 1000 * 1000;
            default:
                return 0;
        }
    } else {
        return 40 * 1000 * 1000;
    }
}

