ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_XClk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* rc32m */
        return (32 * 1000 * 1000);
    } else if (sel == 1) {
        /* xtal */
        return Clock_Xtal_Output();
    } else {
        return 0;
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_F32k_Mux_Output(uint8_t sel)
{
    uint32_t tmpVal;
    uint32_t div = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG0);
    div = BL_GET_REG_BITS_VAL(tmpVal, GLB_DIG_32K_DIV);

    if (sel == 0) {
        /* src32K */
        return (32 * 1000);
    } else if (sel == 1) {
        /* xtal 32K */
        return (32 * 1000);
    } else {
        return Clock_Xtal_Output() / (div + 1);
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_F32k_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_GLB);

    return BL_GET_REG_BITS_VAL(tmpVal, HBN_F32K_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_320M_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm wifi pll 320m */
        return Clock_DSP_Get_WIFI_PLL_Output(320 * 1000 * 1000);
    } else if (sel == 1) {
        /* mm aupll div1 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV1);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_DSP_Get_Muxpll_320M_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_MM_MUXPLL_320M_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_240M_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm wifi pll 240m */
        return Clock_DSP_Get_WIFI_PLL_Output(240 * 1000 * 1000);
    } else if (sel == 1) {
        /* mm aupll div2 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV2);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_DSP_Get_Muxpll_240M_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_MM_MUXPLL_240M_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_160M_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm wifi pll 160m */
        return Clock_DSP_Get_WIFI_PLL_Output(160 * 1000 * 1000);
    } else if (sel == 1) {
        /* cpu pll 160m */
        return Clock_Get_CPU_PLL_Output(160 * 1000 * 1000);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_DSP_Get_Muxpll_160M_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_MM_MUXPLL_160M_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_160M_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* wifi pll 160m */
        return Clock_Get_WIFI_PLL_Output(160 * 1000 * 1000);
    } else if (sel == 1) {
        /* top cpu pll 160m */
        return Clock_Get_CPU_PLL_Output(160 * 1000 * 1000);
    } else if (sel == 2) {
        /* top aupll div2 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV2);
    } else if (sel == 3) {
        /* aupll div2p5 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV2P5);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_Muxpll_160M_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_TOP_MUXPLL_160M_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_80M_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* wifi pll 80m */
        return Clock_Get_WIFI_PLL_Output(80 * 1000 * 1000);
    } else if (sel == 1) {
        /* top cpu pll 80m */
        return Clock_Get_CPU_PLL_Output(80 * 1000 * 1000);
    } else if (sel == 2) {
        /* aupll div5 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV5);
    } else if (sel == 3) {
        /* aupll div6 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV6);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_Muxpll_80M_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DIG_CLK_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_TOP_MUXPLL_80M_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_MCU_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* cpu pll 400m */
        return Clock_Get_CPU_PLL_Output(400 * 1000 * 1000);
    } else if (sel == 1) {
        /* aupll div1 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV1);
    } else if (sel == 2) {
        /* wifi pll 240m */
        return Clock_Get_WIFI_PLL_Output(240 * 1000 * 1000);
    } else if (sel == 3) {
        /* wifi pll 320m */
        return Clock_Get_WIFI_PLL_Output(320 * 1000 * 1000);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_MCU_XClk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_GLB);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, HBN_ROOT_CLK_SEL);

    return (tmpVal & 0x1);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_MCU_Root_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_GLB);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, HBN_ROOT_CLK_SEL);

    return ((tmpVal >> 1) & 0x1);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_MCU_Root_Clk_Mux_Output(uint8_t sel)
{
    uint32_t tmpVal;

    if (sel == 0) {
        /* xclk */
        return Clock_XClk_Mux_Output(Clock_Get_MCU_XClk_Sel_Val());
    } else if (sel == 1) {
        /* pll */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG1);
        sel = BL_GET_REG_BITS_VAL(tmpVal, PDS_REG_PLL_SEL);
        return Clock_MCU_Clk_Mux_Output(sel);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_MCU_HClk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_SYS_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_HCLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_Peri_BClk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_SYS_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_BCLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_LP_Clk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CPU_CORE_CFG7);

    return BL_GET_REG_BITS_VAL(tmpVal, PDS_REG_PICO_DIV);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_XClk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* rc32m */
        return (32 * 1000 * 1000);
    } else if (sel == 1) {
        /* xtal */
        return Clock_Xtal_Output();
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_DSP_XClk_Sel_Val(void)
{
    uint32_t tmpVal;

