ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_XCLK_CLK_SEL);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_DSP_Root_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_ROOT_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm mux 240m */
        return Clock_DSP_240M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_240M_Sel_Val());
    } else if (sel == 1) {
        /* mm mux 320m  */
        return Clock_DSP_320M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_320M_Sel_Val());
    } else if (sel == 2 || sel == 3) {
        /* cpu pll 400m */
        return Clock_Get_CPU_PLL_Output(400 * 1000 * 1000);
    } else {
        return 0;
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_Root_Clk_Mux_Output(uint8_t sel)
{
    uint32_t tmpVal;

    if (sel == 0) {
        /* xclk */
        return Clock_DSP_XClk_Mux_Output(Clock_Get_DSP_XClk_Sel_Val());
    } else if (sel == 1) {
        /* pll */
        tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
        sel = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_SEL);
        return Clock_DSP_Clk_Mux_Output(sel);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_DSP_HClk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_DSP_BClk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK2X_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_DSP_MM_Bclk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_SEL);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_MM_BClk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_DIV);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_DSP_MM_BCLK_Mux_Output(uint8_t sel)
{
    if (sel == 0 || sel == 1) {
        /* mm xclk */
        return Clock_DSP_XClk_Mux_Output(Clock_Get_DSP_XClk_Sel_Val());
    } else if (sel == 2) {
        /* mm mux 160m */
        return Clock_DSP_160M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_160M_Sel_Val());
    } else if (sel == 3) {
        /* mm mux 240m */
        return Clock_DSP_240M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_240M_Sel_Val());
    } else {
        return 0;
    }
}

/****************************************************************************/ /**
 * @brief  Get System Clock
 *
 * @param  type: System clock type
 *
 * @return System clock value
 *
*******************************************************************************/
uint32_t ATTR_CLOCK_SECTION Clock_System_Clock_Get(BL_System_Clock_Type type)
{
    uint32_t clock = 0;
    uint32_t div = 0;

    switch (type) {
        case BL_SYSTEM_CLOCK_MCU_XCLK:
            /*!< mcu xclk clock */
            return Clock_XClk_Mux_Output(Clock_Get_MCU_XClk_Sel_Val());
        case BL_SYSTEM_CLOCK_MCU_ROOT_CLK:
            /*!< mcu root clock */
            return Clock_MCU_Root_Clk_Mux_Output(Clock_Get_MCU_Root_Clk_Sel_Val());

        case BL_SYSTEM_CLOCK_MCU_CLK:
            /*!< mcu fast clock/cpu clock */
            clock = Clock_MCU_Root_Clk_Mux_Output(Clock_Get_MCU_Root_Clk_Sel_Val());
            div = Clock_Get_MCU_HClk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_MCU_BCLK:
            ATTR_FALLTHROUGH();

        case BL_SYSTEM_CLOCK_MCU_PBCLK:
            /*!< mcu peri bus clock */
            clock = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_CLK);
            div = Clock_Get_Peri_BClk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_DSP_XCLK:
            /*!< dsp xclk clock */
            return Clock_DSP_XClk_Mux_Output(Clock_Get_DSP_XClk_Sel_Val());

        case BL_SYSTEM_CLOCK_DSP_ROOT_CLK:
            /*!< dsp root clock */
            return Clock_DSP_Root_Clk_Mux_Output(Clock_Get_DSP_Root_Clk_Sel_Val());

        case BL_SYSTEM_CLOCK_DSP_CLK:
            /*!< dsp fast clock/cpu clock */
            clock = Clock_DSP_Root_Clk_Mux_Output(Clock_Get_DSP_Root_Clk_Sel_Val());
            div = Clock_Get_DSP_HClk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_DSP_BCLK:
            /*!< dsp bus clock */
            clock = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_CLK);
            div = Clock_Get_DSP_BClk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_DSP_PBCLK:
            /*!< DSP mm bus clock */
            clock = Clock_DSP_MM_BCLK_Mux_Output(Clock_Get_DSP_MM_Bclk_Sel_Val());
            div = Clock_Get_MM_BClk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_LP_CLK:
            /*!< lp clock */
            clock = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_PBCLK);
            div = Clock_Get_LP_Clk_Div_Val();
            return clock / (div + 1);

        case BL_SYSTEM_CLOCK_F32K:
            /*!< f32k clock */
            return Clock_F32k_Mux_Output(Clock_Get_F32k_Sel_Val());

        case BL_SYSTEM_CLOCK_XTAL:
            /*!< xtal clock */
            return Clock_Xtal_Output();

        default:
            return 0;
    }
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_EMI_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mcu pbclk */
        return Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_PBCLK);
    } else if (sel == 1 || sel == 5) {
        /* emi aupll div1 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV1);
    } else if (sel == 2 || sel == 6) {
        /* emi wifi pll 320m */
        return Clock_EMI_Get_WIFI_PLL_Output(320 * 1000 * 1000);
    } else if (sel == 3 || sel == 7) {
        /* emi cpu pll 400m */
        return Clock_EMI_Get_CPU_PLL_Output(400 * 1000 * 1000);
    } else if (sel == 4) {
        /* emi cpu pll 200m */
        return Clock_EMI_Get_CPU_PLL_Output(200 * 1000 * 1000);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_EMI_Clk_Div_Val(void)
{
    uint32_t tmpVal;

