ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
    tmpVal = BL_RD_REG(GLB_BASE, GLB_EMI_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_EMI_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_EMI_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_EMI_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_EMI_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_EMI_Clk(void)
{
    uint32_t div = 0;

    div = Clock_Get_EMI_Clk_Div_Val();

    return Clock_EMI_Clk_Mux_Output(Clock_Get_EMI_Clk_Sel_Val()) / (div + 1);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_PARAMB_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* emi cpu pll 400m */
        return Clock_EMI_Get_CPU_PLL_Output(400 * 1000 * 1000);
    } else if (sel == 1) {
        /* emi wifi pll 320m */
        return Clock_EMI_Get_WIFI_PLL_Output(320 * 1000 * 1000);
    } else if (sel == 2 || sel == 3) {
        /* mm aupll div1 clk */
        return Clock_Get_AUPLL_Output(CLOCK_AUPLL_DIV1);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_PSRAMB_Clk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_PSRAM_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_PSRAMB_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_PSRAMB_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_PSRAM_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_PSRAMB_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_PSRAMB_Clk(void)
{
    uint32_t div = 0;

    div = Clock_Get_PSRAMB_Clk_Div_Val();

    return Clock_PARAMB_Clk_Mux_Output(Clock_Get_PSRAMB_Clk_Sel_Val()) / (div + 1);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_ISP_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm mux 160m */
        return Clock_DSP_160M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_160M_Sel_Val());
    } else if (sel == 1) {
        /* mm mux 240m */
        return Clock_DSP_240M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_240M_Sel_Val());
    } else if (sel == 2) {
        /* cpu pll 400m */
        return Clock_Get_CPU_PLL_Output(400 * 1000 * 1000);
    } else if (sel == 3) {
        /* mm xclk */
        return Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_XCLK);;
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_ISP_Clk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_ISP_DP_CLK);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_ISP_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_ISP_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_ISP_DP_CLK);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_ISP_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_ISP_Clk(void)
{
    uint32_t div = 0;

    div = Clock_Get_ISP_Clk_Div_Val();

    return Clock_ISP_Clk_Mux_Output(Clock_Get_ISP_Clk_Sel_Val()) / (div + 1);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_H264_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm mux 160m */
        return Clock_DSP_160M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_160M_Sel_Val());
    } else if (sel == 1) {
        /* mm mux 240m  */
        return Clock_DSP_240M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_240M_Sel_Val());
    } else if (sel == 2 || sel == 3) {
        /* mm mux 320m */
        return Clock_DSP_320M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_320M_Sel_Val());
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_H264_Clk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_CODEC_CLK);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_H264_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_H264_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_CODEC_CLK);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_H264_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_H264_Clk(void)
{
    uint32_t div = 0;

    div = Clock_Get_H264_Clk_Div_Val();

    return Clock_H264_Clk_Mux_Output(Clock_Get_H264_Clk_Sel_Val()) / (div + 1);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_BLAI_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* mm mux 160m */
        return Clock_DSP_160M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_160M_Sel_Val());
    } else if (sel == 1) {
        /* mm mux 240m  */
        return Clock_DSP_240M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_240M_Sel_Val());
    } else if (sel == 2 || sel == 3) {
        /* mm mux 320m */
        return Clock_DSP_320M_Clk_Mux_Output(Clock_DSP_Get_Muxpll_320M_Sel_Val());
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_BLAI_Clk_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CNN_CLK_DIV);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_BLAI_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);

    return BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CNN_CLK_SEL);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Get_BLAI_Clk(void)
{
    uint32_t div = 0;

    div = Clock_Get_BLAI_Clk_Div_Val();

    return Clock_BLAI_Clk_Mux_Output(Clock_Get_BLAI_Clk_Sel_Val()) / (div + 1);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_MIPI_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_MIPI_PLL_CFG1);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_MIPIPLL_EVEN_DIV_RATIO);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_MIPI_Clk_Mux_Output(void)
{   
    return Clock_Get_MIPI_PLL_Output();
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Display_Clk_Mux_Output(uint8_t sel)
{
    uint32_t div = 0;

    if (sel == 0) {
        /* displ pll clk */
        div = Clock_Get_MIPI_Div_Val();
        return Clock_MIPI_Clk_Mux_Output() / div;
    } else if (sel == 1) {
        /* mm xclk */
        return Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_XCLK);
    } else {
        return 0;
    }
}

