ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
    tmpVal = BL_RD_REG(GLB_BASE, GLB_AUDIO_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_AUDIO_DAC_CLK_DIV);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_SDH_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* wifi pll 96m */
        return Clock_Get_WIFI_PLL_Output(96 * 1000 * 1000);
    } else {
        /* cpu pll 100m */
        return Clock_Get_CPU_PLL_Output(100 * 1000 * 1000);
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_SDH_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_SDH_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_SDH_CLK_SEL);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_SDH_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_SDH_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_SDH_CLK_DIV);
}

__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_CAM_Clk_Mux_Output(uint8_t sel)
{
    if (sel == 0) {
        /* xclk */
        return Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_XCLK);
    } else if (sel == 1) {
        /* wifi pull 960m */
        return Clock_Get_WIFI_PLL_Output(96 * 1000 * 1000);
    } else if (sel == 2 || sel == 3) {
        /* cpu pll 100m */
        return Clock_Get_CPU_PLL_Output(100 * 1000 * 1000);
    } else {
        return 0;
    }
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_CAM_Clk_Sel_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CAM_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_CAM_REF_CLK_SRC_SEL);
}

__UNUSED__ static uint8_t ATTR_CLOCK_SECTION Clock_Get_CAM_Div_Val(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CAM_CFG0);

    return BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_CAM_REF_CLK_DIV);
}

/****************************************************************************/ /**

 * @brief  Get Audio ADC Clock
 *
 * @return Audio ADC clock value
 *
*******************************************************************************/
__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Audio_ADC_Clock_Get(void)
{
    uint32_t clock = 0;
    uint32_t div = 0;

    clock = Clock_ADC_Clk_Mux_Output();
    div = Clock_Get_ADC_Div_Val();

    return clock / (div + 1);
}

/****************************************************************************/ /**

 * @brief  Get Audio DAC Clock
 *
 * @return Audio DAC clock value
 *
*******************************************************************************/
__UNUSED__ static uint32_t ATTR_CLOCK_SECTION Clock_Audio_DAC_Clock_Get(void)
{
    uint32_t clock = 0;
    uint32_t div = 0;

    clock = Clock_DAC_Clk_Mux_Output();
    div = Clock_Get_DAC_Div_Val();

    return clock / (div + 1);
}

/****************************************************************************/ /**

 * @brief  Get Peripheral1 Clock
 *
 * @param  type: Peripheral1 clock type
 *
 * @return Peripheral1 clock value
 *
*******************************************************************************/
uint32_t ATTR_CLOCK_SECTION Clock_Peripheral_Clock_Get(BL_Peripheral_Type type)
{
    uint32_t clock = 0;
    uint32_t div = 0;

    switch (type) {
        /*!< uart0 clock */
        case BL_PERIPHERAL_CLOCK_UART0:
            ATTR_FALLTHROUGH();

        /*!< uart1 clock */
        case BL_PERIPHERAL_CLOCK_UART1:
            ATTR_FALLTHROUGH();

        /*!< uart2 clock */
        case BL_PERIPHERAL_CLOCK_UART2:
            clock = Clock_UART_Clk_Mux_Output(Clock_Get_UART_Clk_Sel_Val());
            div = Clock_Get_UART_Div_Val();
            return clock / (div + 1);

        /*!< uart3 clock */
        case BL_PERIPHERAL_CLOCK_UART3:
            clock = Clock_DSP_UART_Clk_Mux_Output(Clock_Get_DSP_UART_Clk_Sel_Val());
            div = Clock_Get_DSP_UART0_Div_Val();
            return clock / (div + 1);

#ifndef CONFIG_SUPPORT_UART_CLOCK_GET_ONLY
        /*!< spi0 clock */
        case BL_PERIPHERAL_CLOCK_SPI0:
            clock = Clock_SPI_Clk_Mux_Output(Clock_Get_SPI_Clk_Sel_Val());
            div = Clock_Get_SPI_Div_Val();
            return clock / (div + 1);

        /*!< spi1 clock */
        case BL_PERIPHERAL_CLOCK_SPI1:
            clock = Clock_DSP_SPI_Clk_Mux_Output(Clock_Get_DSP_SPI_Clk_Sel_Val());
            div = Clock_Get_DSP_SPI_Div_Val();
            return clock / (div + 1);

        /*!< i2c0 clock */
        case BL_PERIPHERAL_CLOCK_I2C0:
            ATTR_FALLTHROUGH();

        /*!< i2c1 clock */
        case BL_PERIPHERAL_CLOCK_I2C1:
            clock = Clock_I2C_Clk_Mux_Output(Clock_Get_I2C_Clk_Sel_Val());
            div = Clock_Get_I2C_Div_Val();
            return clock / (div + 1);

        /*!< i2c2 clock */
        case BL_PERIPHERAL_CLOCK_I2C2:
            clock = Clock_DSP_I2C_Clk_Mux_Output(Clock_Get_DSP_I2C_Clk_Sel_Val());
            div = Clock_Get_DSP_I2C0_Div_Val();
            return clock / (div + 1);

        /*!< i2c3 clock */
        case BL_PERIPHERAL_CLOCK_I2C3:
            clock = Clock_DSP_I2C_Clk_Mux_Output(Clock_Get_DSP_I2C_Clk_Sel_Val());
            div = Clock_Get_DSP_I2C1_Div_Val();
            return clock / (div + 1);

        /*!< PSRAMB clock */
        case BL_PERIPHERAL_CLOCK_PSRAMB:
            return Clock_Get_PSRAMB_Clk();

        /*!< FLASH clock */
        case BL_PERIPHERAL_CLOCK_FLASH:
            clock = Clock_SF_SEL_Clk_Mux_Output(Clock_Get_SF_Clk_Sel_Val());
            div = Clock_Get_SF_Div_Val();
            return clock / (div + 1);

        /*!< I2S clock */
        case BL_PERIPHERAL_CLOCK_I2S:
            clock = Clock_I2S_Clk_Mux_Output();
            div = Clock_Get_I2S_Div_Val();
            return clock / (div + 1);

        /*!< BLAI clock */
        case BL_PERIPHERAL_CLOCK_BLAI:
            return Clock_Get_BLAI_Clk();

        /*!< DISPLAY clock */
        case BL_PERIPHERAL_CLOCK_DISPLAY:
            return Clock_Get_Display_Clk();

