ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
        /*!< IR clock */
        case BL_PERIPHERAL_CLOCK_IR:
            clock = Clock_IR_Clk_Mux_Output();
            div = Clock_Get_IR_Div_Val();
            return clock / (div + 1);

        /*!< PDM clock */
        case BL_PERIPHERAL_CLOCK_PDM:
            clock = Clock_PDM_Clk_Mux_Output();
            div = Clock_Get_PDM_Div_Val();
            return clock / (div + 1);

        /*!< ADC clock */
        case BL_PERIPHERAL_CLOCK_ADC:
            return Clock_Audio_ADC_Clock_Get();

        /*!< DAC clock */
        case BL_PERIPHERAL_CLOCK_DAC:
            return Clock_Audio_DAC_Clock_Get();

        /*!< GPADC clock */
        case BL_PERIPHERAL_CLOCK_GPADC:
            return Clock_GPADC_Clk_Mux_Output(Clock_Get_GPADC_Clk_Sel_Val());

        /*!< GPDAC clock */
        case BL_PERIPHERAL_CLOCK_GPDAC:
            clock = Clock_GPDAC_Clk_Mux_Output(Clock_Get_GPDAC_Clk_Sel_Val());
            div = Clock_Get_GPDAC_Div_Val();
            return clock / (div + 1);

        /*!< CAM clock */
        case BL_PERIPHERAL_CLOCK_CAM:
            clock = Clock_CAM_Clk_Mux_Output(Clock_Get_CAM_Clk_Sel_Val());
            div = Clock_Get_CAM_Div_Val();
            return clock / (div + 1);

        /*!< SDH clock */
        case BL_PERIPHERAL_CLOCK_SDH:
            clock = Clock_SDH_Clk_Mux_Output(Clock_Get_SDH_Clk_Sel_Val());
            div = Clock_Get_SDH_Div_Val();
            return clock / (div + 1);

        /*!< PKA clock */
        case BL_PERIPHERAL_CLOCK_PKA:
            return Clock_PKA_Clk_Mux_Output(Clock_Get_PKA_Clk_Sel_Val());

        /*!< EMI clock */
        case BL_PERIPHERAL_CLOCK_EMI:
            return Clock_Get_EMI_Clk();

        /*!< H264 clock */
        case BL_PERIPHERAL_CLOCK_H264:
            return Clock_Get_H264_Clk();

        /*!< ISP clock */
        case BL_PERIPHERAL_CLOCK_ISP:
            return Clock_Get_ISP_Clk();
#endif
        default:
            return 0;
    }
}

/****************************************************************************/ /**
 * @brief  get system core clock
 *
 * @param  None
 *
 * @return system core clock value
 *
*******************************************************************************/
uint32_t ATTR_CLOCK_SECTION SystemCoreClockGet(void)
{
    uint32_t clockVal = 0;

    switch (GLB_Get_Core_Type()) {
        case GLB_CORE_ID_M0:
            clockVal = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_CLK);
            break;
        case GLB_CORE_ID_D0:
            clockVal = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_CLK);
            break;
        case GLB_CORE_ID_LP:
            clockVal = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_LP_CLK);
            break;
        default:
            clockVal = 0;
            break;
    }
    clockVal = clockVal ? clockVal : (32 * 1000 * 1000);

    return clockVal;
}

/****************************************************************************/ /**
 * @brief  mcu rtc reset
 *
 * @param  rstEn: hold reset or not
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION CPU_Set_MTimer_RST(uint8_t rstEn)
{
    uint32_t tmpVal = 0;
    uint32_t address = 0;

    switch (GLB_Get_Core_Type()) {
        case GLB_CORE_ID_M0:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            break;
        case GLB_CORE_ID_D0:
            address = MM_MISC_BASE + MM_MISC_CPU_RTC_OFFSET;
            break;
        case GLB_CORE_ID_LP:
            address = PDS_BASE + PDS_CPU_CORE_CFG8_OFFSET;
            break;
        default:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            break;
    }

    /* set reset */
    /* MCU RTC_RST is [30] */
    /* DSP RTC_RST is [30] */
    /* LP  RTC_RST is [30] */
    tmpVal = BL_RD_WORD(address);
    if (rstEn) {
        tmpVal = BL_SET_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_RST);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_RST);
    }
    BL_WR_WORD(address, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  mcu rtc reset
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION CPU_Reset_MTimer(void)
{
    CPU_Set_MTimer_RST(1);
    CPU_Set_MTimer_RST(0);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set mcu rtc clock
 *
 * @param  enable: ENABLE or DISABLE
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION CPU_Set_MTimer_CLK(uint8_t enable, uint16_t div)
{
    uint32_t tmpVal = 0;
    uint32_t address = 0;

    CHECK_PARAM((div <= 0x3FF));

    switch (GLB_Get_Core_Type()) {
        case GLB_CORE_ID_M0:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            break;
        case GLB_CORE_ID_D0:
            address = MM_MISC_BASE + MM_MISC_CPU_RTC_OFFSET;
            break;
        case GLB_CORE_ID_LP:
            address = PDS_BASE + PDS_CPU_CORE_CFG8_OFFSET;
            break;
        default:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            break;
    }

    /* disable rtc first */
    /* MCU RTC_EN is [31] */
    /* DSP RTC_EN is [31] */
    /* LP  RTC_EN is [31] */
    tmpVal = BL_RD_WORD(address);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    BL_WR_WORD(address, tmpVal);

    /* set div */
    /* MCU RTC_DIV is [9:0] */
    /* DSP RTC_DIV is [9:0] */
    /* LP  RTC_DIV is [9:0] */
    tmpVal = BL_RD_WORD(address);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MCU_MISC_REG_MCU_RTC_DIV, div);
    BL_WR_WORD(address, tmpVal);

    /* enable or not */
    /* MCU RTC_EN is [31] */
    /* DSP RTC_EN is [31] */
    /* LP  RTC_EN is [31] */
    tmpVal = BL_RD_WORD(address);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, MCU_MISC_REG_MCU_RTC_EN);
    }
    BL_WR_WORD(address, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get cpu rtc source clock
 *
 * @param  None
 *
 * @return cpu rtc source clock
 *
*******************************************************************************/
uint32_t ATTR_CLOCK_SECTION CPU_Get_MTimer_Source_Clock(void)
{
    uint32_t coreFreq = 0;

