ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_clock.c
    /* get cpu core clock */
    switch (GLB_Get_Core_Type()) {
        case GLB_CORE_ID_M0:
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_CLK);
            break;
        case GLB_CORE_ID_D0:
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_CLK);
            break;
        case GLB_CORE_ID_LP:
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_LP_CLK);
            break;
        default:
            coreFreq = 0;
            break;
    }
    coreFreq = coreFreq ? coreFreq : (32 * 1000 * 1000);

    return coreFreq;
}

/****************************************************************************/ /**
 * @brief  get mcu rtc clock
 *
 * @param  None
 *
 * @return mcu rtc counter clock
 *
*******************************************************************************/
uint32_t ATTR_CLOCK_SECTION CPU_Get_MTimer_Clock(void)
{
    uint32_t coreFreq = 0;
    uint32_t address = 0;
    uint32_t div = 0;

    /* get cpu core clock */
    /* get mtimer clock div */
    switch (GLB_Get_Core_Type()) {
        case GLB_CORE_ID_M0:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_MCU_CLK);
            break;
        case GLB_CORE_ID_D0:
            address = MM_MISC_BASE + MM_MISC_CPU_RTC_OFFSET;
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_DSP_CLK);
            break;
        case GLB_CORE_ID_LP:
            address = PDS_BASE + PDS_CPU_CORE_CFG8_OFFSET;
            coreFreq = Clock_System_Clock_Get(BL_SYSTEM_CLOCK_LP_CLK);
            break;
        default:
            address = MCU_MISC_BASE + MCU_MISC_MCU_E907_RTC_OFFSET;
            coreFreq = 0;
            break;
    }
    /* MCU RTC_DIV is [9:0] */
    /* DSP RTC_DIV is [9:0] */
    /* LP  RTC_DIV is [9:0] */
    div = BL_GET_REG_BITS_VAL(BL_RD_WORD(address), MCU_MISC_REG_MCU_RTC_DIV);
    div += 1;
    coreFreq = coreFreq ? coreFreq : (32 * 1000 * 1000);
    coreFreq = coreFreq / div; /* mtimer clock = cpu clock / mtimer div */

    return coreFreq;
}

/****************************************************************************/ /**
 * @brief  get mcu rtc counter
 *
 * @param  None
 *
 * @return mcu rtc counter
 *
*******************************************************************************/
uint64_t ATTR_CLOCK_SECTION CPU_Get_MTimer_Counter(void)
{
#if (__riscv_xlen == 64)
    return (uint64_t)csi_coret_get_value();
#else
    volatile uint32_t tmpValLow, tmpValHigh, tmpValHigh1;
    uint32_t cnt = 0;

    do {
        tmpValHigh = csi_coret_get_valueh();
        tmpValLow = csi_coret_get_value();
        tmpValHigh1 = csi_coret_get_valueh();
        cnt++;
        if (cnt > 5000) {
            break;
        }
    } while (tmpValHigh != tmpValHigh1);

    return (uint64_t)(((uint64_t)tmpValHigh << 32) + tmpValLow);
#endif
}

/****************************************************************************/ /**
 * @brief  get mcu cycle
 *
 * @param  None
 *
 * @return mcu cycle
 *
*******************************************************************************/
uint64_t ATTR_CLOCK_SECTION CPU_Get_CPU_Cycle(void)
{
#if (__riscv_xlen == 64)
    return (uint64_t)__get_MCYCLE();
#else
    volatile uint32_t tmpValLow, tmpValHigh, tmpValHigh1;
    uint32_t cnt = 0;

    do {
        tmpValHigh = __get_MCYCLEH();
        tmpValLow = __get_MCYCLE();
        tmpValHigh1 = __get_MCYCLEH();
        cnt++;
        if (cnt > 5000) {
            break;
        }
    } while (tmpValHigh != tmpValHigh1);

    return (uint64_t)(((uint64_t)tmpValHigh << 32) + tmpValLow);
#endif
}

/****************************************************************************/ /**
 * @brief  get mcu rtc counter in us
 *
 * @param  None
 *
 * @return mcu rtc counter in us
 *
*******************************************************************************/
uint64_t ATTR_CLOCK_SECTION CPU_Get_MTimer_US(void)
{
    uint32_t clk = SystemCoreClockGet();
    uint64_t mtimer_counter = CPU_Get_MTimer_Counter();

    if (mtimer_counter < 10) {
        mtimer_counter = CPU_Get_CPU_Cycle();
        return (uint32_t)mtimer_counter/(clk/1000000);
    }

    if(clk>1000*1000){
        /* system_clock > 1MHz  ==>  mtimer_clock is 1MHz */
        /* return mtimer_count after mtimer_init_1MHz */
        return CPU_Get_MTimer_Counter();
    }else{
        /* system_clock < 1MHz  ==>  mtimer_clock is 1KHz */
        /* return mtimer_count*1000 after mtimer_init_1KHz */
        return CPU_Get_MTimer_Counter()*1000;
    }
}

/****************************************************************************/ /**
 * @brief  get mcu rtc counter in ms
 *
 * @param  None
 *
 * @return mcu rtc counter in ms
 *
*******************************************************************************/
uint64_t ATTR_CLOCK_SECTION CPU_Get_MTimer_MS(void)
{
    uint32_t clk = SystemCoreClockGet();
    uint64_t mtimer_counter = CPU_Get_MTimer_Counter();

    if (mtimer_counter < 10) {
        mtimer_counter = CPU_Get_CPU_Cycle();
        return (uint32_t)mtimer_counter/(clk/1000);
    }

    if(clk>1000*1000){
        /* system_clock > 1MHz  ==>  mtimer_clock is 1MHz */
        /* return mtimer_count/1000 after mtimer_init_1MHz */
        mtimer_counter = CPU_Get_MTimer_Counter();
#ifndef CONFIG_SUPPORT_U32_DIV_ONLY
        return  mtimer_counter/1000;
#else
        if(mtimer_counter<(1<<30)){
            return (uint32_t)mtimer_counter/1000;
        }else{
            //return CPU_Get_MTimer_Counter()/1000;
            return (mtimer_counter>>10)+(mtimer_counter>>15)-(mtimer_counter>>17)+(mtimer_counter>>21);
        }
#endif
    }else{
        /* system_clock < 1MHz  ==>  mtimer_clock is 1KHz */
        /* return mtimer_count after mtimer_init_1KHz */
        return CPU_Get_MTimer_Counter();
    }
}

/****************************************************************************/ /**
 * @brief  mcu timer delay us
 *
 * @param  cnt: us
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION CPU_MTimer_Delay_US(uint32_t cnt)
{
    volatile uint64_t us1 = 0;
    volatile uint64_t us2 = 0;

    us1 = CPU_Get_MTimer_US();
    do {
        us2 = CPU_Get_MTimer_US();
    } while (((us2 - us1) < (uint64_t)(cnt)));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  mcu timer delay ms
 *
 * @param  cnt: ms
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION CPU_MTimer_Delay_MS(uint32_t cnt)
{
    volatile uint64_t ms1 = 0;
    volatile uint64_t ms2 = 0;

    ms1 = CPU_Get_MTimer_MS();
    do {
        ms2 = CPU_Get_MTimer_MS();
    } while (((ms2 - ms1) < (uint64_t)(cnt)));

    return SUCCESS;
}

/*@} end of group CLOCK_Public_Functions */

/*@} end of group CLOCK */

/*@} end of group BL606P_Peripheral_Driver */
